app/controllers/alerts_controller.rb

  def index
    @alerts = Alert.all
---
SELECT * FROM "alerts"