app/controllers/comments_controller.rb

SELECT * FROM "comments" WHERE ("comments".post_id = 7)
---
  def find_comment
    setup_enclosing_resources
    @comment = @post.comments.find(params[:id])

INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id") VALUES('2009-12-04 17:32:16', '', '2009-12-04 17:32:16', 7)
---
  def create
    respond_to do |format|
      if @comment.save