app/controllers/contracts_controller.rb

  def show
    @contract = Contract.find(params[:id])
---
SELECT * FROM "contracts" WHERE ("contracts"."id" = 1)

  def create
    @contract = Contract.new(params[:contract])

    respond_to do |format|
      if @contract.save
---
INSERT INTO "contracts" ("number", "signature_date", "expiration_date", "created_at", "title", "updated_at", "effective_date") VALUES('A-Job', '12/07/2009', 'none', '2009-12-06 00:03:18', 'This is databased backed', '2009-12-06 00:03:18', 'pending')

def alerts
  if params[:id].present?
    alerts = Contract.find(params[:id]).alerts.find(:all) do
---
SELECT * FROM "contracts" WHERE ("contracts"."id" = 1)