app/controllers/posts_controller.rb

  def find_post
    setup_enclosing_resources
    @post = @user.posts.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 9 AND ("posts".user_id = 2))

  def create
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "body", "title", "updated_at", "user_id") VALUES('2009-12-04 17:21:40', 'I work for Bill the CTo', 'On organization', '2009-12-04 17:21:40', 2)

  def update
    respond_to do |format|
      if @post.update_attributes(params[:post])
---
UPDATE "posts" SET "updated_at" = '2009-12-04 23:09:07', "title" = 'I am editing this post', "body" = 'Posts should not have the word body in them when they are being displayed.' WHERE "id" = 4

  def destroy
    @post.destroy
---
DELETE FROM "posts" WHERE "id" = 6