app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 2)
---
  def find_user
    setup_enclosing_resources
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "created_at", "updated_at", "email") VALUES('Bill Conklin', '2009-12-04 19:43:40', '2009-12-04 19:43:40', 'william.conklin@poweradvocate.com')
---
  def create
    respond_to do |format|
      if @user.save

UPDATE "users" SET "updated_at" = '2009-12-04 22:13:06', "name" = 'Tyler Short' WHERE "id" = 2
---
  def update
    respond_to do |format|
      if @user.update_attributes(params[:user])